Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_PUF.h
/*! @name CTRL - PUF Control Register */
/*! @{ */

#define PUF_CTRL_ZEROIZE_MASK                    (0x1U)
#define PUF_CTRL_ZEROIZE_SHIFT                   (0U)
/*! ZEROIZE - Begin Zeroize operation for PUF and go to Error state
 *  0b0..No Zeroize operation in progress
 *  0b1..Zeroize operation in progress
 */
#define PUF_CTRL_ZEROIZE(x)                      (((uint32_t)(((uint32_t)(x)) << PUF_CTRL_ZEROIZE_SHIFT)) & PUF_CTRL_ZEROIZE_MASK)

#define PUF_CTRL_ENROLL_MASK                     (0x2U)
#define PUF_CTRL_ENROLL_SHIFT                    (1U)
/*! ENROLL - Begin Enroll operation
 *  0b0..No Enroll operation in progress
 *  0b1..Enroll operation in progress
 */
#define PUF_CTRL_ENROLL(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_CTRL_ENROLL_SHIFT)) & PUF_CTRL_ENROLL_MASK)

#define PUF_CTRL_START_MASK                      (0x4U)
#define PUF_CTRL_START_SHIFT                     (2U)
/*! START - Begin Start operation
 *  0b0..No Start operation in progress
 *  0b1..Start operation in progress
 */
#define PUF_CTRL_START(x)                        (((uint32_t)(((uint32_t)(x)) << PUF_CTRL_START_SHIFT)) & PUF_CTRL_START_MASK)

#define PUF_CTRL_GENERATEKEY_MASK                (0x8U)
#define PUF_CTRL_GENERATEKEY_SHIFT               (3U)
/*! GENERATEKEY - Begin Set Intrinsic Key operation
 *  0b0..No Set Intrinsic Key operation in progress
 *  0b1..Set Intrinsic Key operation in progress
 */
#define PUF_CTRL_GENERATEKEY(x)                  (((uint32_t)(((uint32_t)(x)) << PUF_CTRL_GENERATEKEY_SHIFT)) & PUF_CTRL_GENERATEKEY_MASK)

#define PUF_CTRL_SETKEY_MASK                     (0x10U)
#define PUF_CTRL_SETKEY_SHIFT                    (4U)
/*! SETKEY - Begin Set User Key operation
 *  0b0..No Set Key operation in progress
 *  0b1..Set Key operation in progress
 */
#define PUF_CTRL_SETKEY(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_CTRL_SETKEY_SHIFT)) & PUF_CTRL_SETKEY_MASK)

#define PUF_CTRL_GETKEY_MASK                     (0x40U)
#define PUF_CTRL_GETKEY_SHIFT                    (6U)
/*! GETKEY - Begin Get Key operation
 *  0b0..No Get Key operation in progress
 *  0b1..Get Key operation in progress
 */
#define PUF_CTRL_GETKEY(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_CTRL_GETKEY_SHIFT)) & PUF_CTRL_GETKEY_MASK)
/*! @} */

/*! @name KEYINDEX - PUF Key Index Register */
/*! @{ */

#define PUF_KEYINDEX_KEYIDX_MASK                 (0xFU)
#define PUF_KEYINDEX_KEYIDX_SHIFT                (0U)
/*! KEYIDX - PUF Key Index
 *  0b0000..USE INDEX0
 *  0b0001..USE INDEX1
 *  0b0010..USE INDEX2
 *  0b0011..USE INDEX3
 *  0b0100..USE INDEX4
 *  0b0101..USE INDEX5
 *  0b0110..USE INDEX6
 *  0b0111..USE INDEX7
 *  0b1000..USE INDEX8
 *  0b1001..USE INDEX9
 *  0b1010..USE INDEX10
 *  0b1011..USE INDEX11
 *  0b1100..USE INDEX12
 *  0b1101..USE INDEX13
 *  0b1110..USE INDEX14
 *  0b1111..USE INDEX15
 */
#define PUF_KEYINDEX_KEYIDX(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_KEYINDEX_KEYIDX_SHIFT)) & PUF_KEYINDEX_KEYIDX_MASK)
/*! @} */

/*! @name KEYSIZE - PUF Key Size Register */
/*! @{ */

#define PUF_KEYSIZE_KEYSIZE_MASK                 (0x3FU)
#define PUF_KEYSIZE_KEYSIZE_SHIFT                (0U)
/*! KEYSIZE - PUF Key Size
 *  0b000000..Key Size is 512 Bytes and KC Size is 532 Bytes
 *  0b000001..Key Size is 8 Bytes and KC Size is 52 Bytes
 *  0b000010..Key Size is 16 Bytes and KC Size is 52 Bytes
 *  0b000011..Key Size is 24 Bytes and KC Size is 52 Bytes
 *  0b000100..Key Size is 32 Bytes and KC Size is 52 Bytes
 *  0b000101..Key Size is 40 Bytes and KC Size is 84 Bytes
 *  0b000110..Key Size is 48 Bytes and KC Size is 84 Bytes
 *  0b000111..Key Size is 56 Bytes and KC Size is 84 Bytes
 *  0b001000..Key Size is 64 Bytes and KC Size is 84 Bytes
 *  0b001001..Key Size is 72 Bytes and KC Size is 116 Bytes
 *  0b001010..Key Size is 80 Bytes and KC Size is 116 Bytes
 *  0b001011..Key Size is 88 Bytes and KC Size is 116 Bytes
 *  0b001100..Key Size is 96 Bytes and KC Size is 116 Bytes
 *  0b001101..Key Size is 104 Bytes and KC Size is 148 Bytes
 *  0b001110..Key Size is 112 Bytes and KC Size is 148 Bytes
 *  0b001111..Key Size is 120 Bytes and KC Size is 148 Bytes
 *  0b010000..Key Size is 128 Bytes and KC Size is 148 Bytes
 *  0b010001..Key Size is 136 Bytes and KC Size is 180 Bytes
 *  0b010010..Key Size is 144 Bytes and KC Size is 180 Bytes
 *  0b010011..Key Size is 152 Bytes and KC Size is 180 Bytes
 *  0b010100..Key Size is 160 Bytes and KC Size is 180 Bytes
 *  0b010101..Key Size is 168 Bytes and KC Size is 212 Bytes
 *  0b010110..Key Size is 176 Bytes and KC Size is 212 Bytes
 *  0b010111..Key Size is 184 Bytes and KC Size is 212 Bytes
 *  0b011000..Key Size is 192 Bytes and KC Size is 212 Bytes
 *  0b011001..Key Size is 200 Bytes and KC Size is 244 Bytes
 *  0b011010..Key Size is 208 Bytes and KC Size is 244 Bytes
 *  0b011011..Key Size is 216 Bytes and KC Size is 244 Bytes
 *  0b011100..Key Size is 224 Bytes and KC Size is 244 Bytes
 *  0b011101..Key Size is 232 Bytes and KC Size is 276 Bytes
 *  0b011110..Key Size is 240 Bytes and KC Size is 276 Bytes
 *  0b011111..Key Size is 248 Bytes and KC Size is 276 Bytes
 *  0b100000..Key Size is 256 Bytes and KC Size is 276 Bytes
 *  0b100001..Key Size is 264 Bytes and KC Size is 308 Bytes
 *  0b100010..Key Size is 272 Bytes and KC Size is 308 Bytes
 *  0b100011..Key Size is 280 Bytes and KC Size is 308 Bytes
 *  0b100100..Key Size is 288 Bytes and KC Size is 308 Bytes
 *  0b100101..Key Size is 296 Bytes and KC Size is 340 Bytes
 *  0b100110..Key Size is 304 Bytes and KC Size is 340 Bytes
 *  0b100111..Key Size is 312 Bytes and KC Size is 340 Bytes
 *  0b101000..Key Size is 320 Bytes and KC Size is 340 Bytes
 *  0b101001..Key Size is 328 Bytes and KC Size is 372 Bytes
 *  0b101010..Key Size is 336 Bytes and KC Size is 372 Bytes
 *  0b101011..Key Size is 344 Bytes and KC Size is 372 Bytes
 *  0b101100..Key Size is 352 Bytes and KC Size is 372 Bytes
 *  0b101101..Key Size is 360 Bytes and KC Size is 404 Bytes
 *  0b101110..Key Size is 368 Bytes and KC Size is 404 Bytes
 *  0b101111..Key Size is 376 Bytes and KC Size is 404 Bytes
 *  0b110000..Key Size is 384 Bytes and KC Size is 404 Bytes
 *  0b110001..Key Size is 392 Bytes and KC Size is 436 Bytes
 *  0b110010..Key Size is 400 Bytes and KC Size is 436 Bytes
 *  0b110011..Key Size is 408 Bytes and KC Size is 436 Bytes
 *  0b110100..Key Size is 416 Bytes and KC Size is 436 Bytes
 *  0b110101..Key Size is 424 Bytes and KC Size is 468 Bytes
 *  0b110110..Key Size is 432 Bytes and KC Size is 468 Bytes
 *  0b110111..Key Size is 440 Bytes and KC Size is 468 Bytes
 *  0b111000..Key Size is 448 Bytes and KC Size is 468 Bytes
 *  0b111001..Key Size is 456 Bytes and KC Size is 500 Bytes
 *  0b111010..Key Size is 464 Bytes and KC Size is 500 Bytes
 *  0b111011..Key Size is 472 Bytes and KC Size is 500 Bytes
 *  0b111100..Key Size is 480 Bytes and KC Size is 500 Bytes
 *  0b111101..Key Size is 488 Bytes and KC Size is 532 Bytes
 *  0b111110..Key Size is 496 Bytes and KC Size is 532 Bytes
 *  0b111111..Key Size is 504 Bytes and KC Size is 532 Bytes
 */
#define PUF_KEYSIZE_KEYSIZE(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_KEYSIZE_KEYSIZE_SHIFT)) & PUF_KEYSIZE_KEYSIZE_MASK)
/*! @} */

/*! @name STAT - PUF Status Register */
/*! @{ */

#define PUF_STAT_BUSY_MASK                       (0x1U)
#define PUF_STAT_BUSY_SHIFT                      (0U)
/*! BUSY - puf_busy
 *  0b0..IDLE
 *  0b1..BUSY
 */
#define PUF_STAT_BUSY(x)                         (((uint32_t)(((uint32_t)(x)) << PUF_STAT_BUSY_SHIFT)) & PUF_STAT_BUSY_MASK)

