Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_PUF.h
#define PUF_IDXBLK_IDXBLK7_MASK                  (0xC000U)
#define PUF_IDXBLK_IDXBLK7_SHIFT                 (14U)
/*! IDXBLK7 - idxblk7 */
#define PUF_IDXBLK_IDXBLK7(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK7_SHIFT)) & PUF_IDXBLK_IDXBLK7_MASK)

#define PUF_IDXBLK_IDXBLK8_MASK                  (0x30000U)
#define PUF_IDXBLK_IDXBLK8_SHIFT                 (16U)
/*! IDXBLK8 - idxblk8 */
#define PUF_IDXBLK_IDXBLK8(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK8_SHIFT)) & PUF_IDXBLK_IDXBLK8_MASK)

#define PUF_IDXBLK_IDXBLK9_MASK                  (0xC0000U)
#define PUF_IDXBLK_IDXBLK9_SHIFT                 (18U)
/*! IDXBLK9 - idxblk9 */
#define PUF_IDXBLK_IDXBLK9(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK9_SHIFT)) & PUF_IDXBLK_IDXBLK9_MASK)

#define PUF_IDXBLK_IDXBLK10_MASK                 (0x300000U)
#define PUF_IDXBLK_IDXBLK10_SHIFT                (20U)
/*! IDXBLK10 - idxblk10 */
#define PUF_IDXBLK_IDXBLK10(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK10_SHIFT)) & PUF_IDXBLK_IDXBLK10_MASK)

#define PUF_IDXBLK_IDXBLK11_MASK                 (0xC00000U)
#define PUF_IDXBLK_IDXBLK11_SHIFT                (22U)
/*! IDXBLK11 - idxblk11 */
#define PUF_IDXBLK_IDXBLK11(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK11_SHIFT)) & PUF_IDXBLK_IDXBLK11_MASK)

#define PUF_IDXBLK_IDXBLK12_MASK                 (0x3000000U)
#define PUF_IDXBLK_IDXBLK12_SHIFT                (24U)
/*! IDXBLK12 - idxblk12 */
#define PUF_IDXBLK_IDXBLK12(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK12_SHIFT)) & PUF_IDXBLK_IDXBLK12_MASK)

#define PUF_IDXBLK_IDXBLK13_MASK                 (0xC000000U)
#define PUF_IDXBLK_IDXBLK13_SHIFT                (26U)
/*! IDXBLK13 - idxblk13 */
#define PUF_IDXBLK_IDXBLK13(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK13_SHIFT)) & PUF_IDXBLK_IDXBLK13_MASK)

#define PUF_IDXBLK_IDXBLK14_MASK                 (0x30000000U)
#define PUF_IDXBLK_IDXBLK14_SHIFT                (28U)
/*! IDXBLK14 - idxblk14 */
#define PUF_IDXBLK_IDXBLK14(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK14_SHIFT)) & PUF_IDXBLK_IDXBLK14_MASK)

#define PUF_IDXBLK_IDXBLK15_MASK                 (0xC0000000U)
#define PUF_IDXBLK_IDXBLK15_SHIFT                (30U)
/*! IDXBLK15 - idxblk15 */
#define PUF_IDXBLK_IDXBLK15(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDXBLK15_SHIFT)) & PUF_IDXBLK_IDXBLK15_MASK)
/*! @} */

/*! @name IDXBLK_DP - PUF Index Block Key Output */
/*! @{ */

#define PUF_IDXBLK_DP_IDXBLK_DP0_MASK            (0x3U)
#define PUF_IDXBLK_DP_IDXBLK_DP0_SHIFT           (0U)
/*! IDXBLK_DP0 - idxblk_dp0 */
#define PUF_IDXBLK_DP_IDXBLK_DP0(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP0_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP0_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP1_MASK            (0xCU)
#define PUF_IDXBLK_DP_IDXBLK_DP1_SHIFT           (2U)
/*! IDXBLK_DP1 - idxblk_dp1 */
#define PUF_IDXBLK_DP_IDXBLK_DP1(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP1_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP1_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP2_MASK            (0x30U)
#define PUF_IDXBLK_DP_IDXBLK_DP2_SHIFT           (4U)
/*! IDXBLK_DP2 - idxblk_dp2 */
#define PUF_IDXBLK_DP_IDXBLK_DP2(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP2_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP2_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP3_MASK            (0xC0U)
#define PUF_IDXBLK_DP_IDXBLK_DP3_SHIFT           (6U)
/*! IDXBLK_DP3 - idxblk_dp3 */
#define PUF_IDXBLK_DP_IDXBLK_DP3(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP3_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP3_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP4_MASK            (0x300U)
#define PUF_IDXBLK_DP_IDXBLK_DP4_SHIFT           (8U)
/*! IDXBLK_DP4 - idxblk_dp4 */
#define PUF_IDXBLK_DP_IDXBLK_DP4(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP4_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP4_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP5_MASK            (0xC00U)
#define PUF_IDXBLK_DP_IDXBLK_DP5_SHIFT           (10U)
/*! IDXBLK_DP5 - idxblk_dp5 */
#define PUF_IDXBLK_DP_IDXBLK_DP5(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP5_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP5_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP6_MASK            (0x3000U)
#define PUF_IDXBLK_DP_IDXBLK_DP6_SHIFT           (12U)
/*! IDXBLK_DP6 - idxblk_dp6 */
#define PUF_IDXBLK_DP_IDXBLK_DP6(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP6_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP6_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP7_MASK            (0xC000U)
#define PUF_IDXBLK_DP_IDXBLK_DP7_SHIFT           (14U)
/*! IDXBLK_DP7 - idxblk_dp7 */
#define PUF_IDXBLK_DP_IDXBLK_DP7(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP7_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP7_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP8_MASK            (0x30000U)
#define PUF_IDXBLK_DP_IDXBLK_DP8_SHIFT           (16U)
/*! IDXBLK_DP8 - idxblk_dp8 */
#define PUF_IDXBLK_DP_IDXBLK_DP8(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP8_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP8_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP9_MASK            (0xC0000U)
#define PUF_IDXBLK_DP_IDXBLK_DP9_SHIFT           (18U)
/*! IDXBLK_DP9 - idxblk_dp9 */
#define PUF_IDXBLK_DP_IDXBLK_DP9(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP9_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP9_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP10_MASK           (0x300000U)
#define PUF_IDXBLK_DP_IDXBLK_DP10_SHIFT          (20U)
/*! IDXBLK_DP10 - idxblk_dp10 */
#define PUF_IDXBLK_DP_IDXBLK_DP10(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP10_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP10_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP11_MASK           (0xC00000U)
#define PUF_IDXBLK_DP_IDXBLK_DP11_SHIFT          (22U)
/*! IDXBLK_DP11 - idxblk_dp11 */
#define PUF_IDXBLK_DP_IDXBLK_DP11(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP11_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP11_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP12_MASK           (0x3000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP12_SHIFT          (24U)
/*! IDXBLK_DP12 - idxblk_dp12 */
#define PUF_IDXBLK_DP_IDXBLK_DP12(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP12_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP12_MASK)

