Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_PUF.h
#define PUF_IDXBLK_DP_IDXBLK_DP13_MASK           (0xC000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP13_SHIFT          (26U)
/*! IDXBLK_DP13 - idxblk_dp13 */
#define PUF_IDXBLK_DP_IDXBLK_DP13(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP13_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP13_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP14_MASK           (0x30000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP14_SHIFT          (28U)
/*! IDXBLK_DP14 - idxblk_dp14 */
#define PUF_IDXBLK_DP_IDXBLK_DP14(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP14_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP14_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP15_MASK           (0xC0000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP15_SHIFT          (30U)
/*! IDXBLK_DP15 - idxblk_dp15 */
#define PUF_IDXBLK_DP_IDXBLK_DP15(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP15_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP15_MASK)
/*! @} */

/*! @name KEYMASK - PUF Key Block 0 Mask Enable..PUF Key Block 1 Mask Enable */
/*! @{ */

#define PUF_KEYMASK_KEYMASK_MASK                 (0xFFFFFFFFU)
#define PUF_KEYMASK_KEYMASK_SHIFT                (0U)
/*! KEYMASK - KEYMASK1 */
#define PUF_KEYMASK_KEYMASK(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_KEYMASK_KEYMASK_SHIFT)) & PUF_KEYMASK_KEYMASK_MASK)
/*! @} */

/*! @name IDXBLK_STATUS - PUF Index Block Setting Status Register */
/*! @{ */

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS0_MASK    (0x3U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS0_SHIFT   (0U)
/*! IDXBLK_STATUS0 - idxblk_status0 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS0(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS0_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS0_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS1_MASK    (0xCU)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS1_SHIFT   (2U)
/*! IDXBLK_STATUS1 - idxblk_status1 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS1(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS1_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS1_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS2_MASK    (0x30U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS2_SHIFT   (4U)
/*! IDXBLK_STATUS2 - idxblk_status2 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS2(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS2_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS2_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS3_MASK    (0xC0U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS3_SHIFT   (6U)
/*! IDXBLK_STATUS3 - idxblk_status3 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS3(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS3_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS3_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS4_MASK    (0x300U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS4_SHIFT   (8U)
/*! IDXBLK_STATUS4 - idxblk_status4 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS4(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS4_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS4_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS5_MASK    (0xC00U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS5_SHIFT   (10U)
/*! IDXBLK_STATUS5 - idxblk_status5 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS5(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS5_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS5_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS6_MASK    (0x3000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS6_SHIFT   (12U)
/*! IDXBLK_STATUS6 - idxblk_status6 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS6(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS6_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS6_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS7_MASK    (0xC000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS7_SHIFT   (14U)
/*! IDXBLK_STATUS7 - idxblk_status7 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS7(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS7_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS7_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS8_MASK    (0x30000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS8_SHIFT   (16U)
/*! IDXBLK_STATUS8 - idxblk_status8 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS8(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS8_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS8_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS9_MASK    (0xC0000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS9_SHIFT   (18U)
/*! IDXBLK_STATUS9 - idxblk_status9 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS9(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS9_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS9_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS10_MASK   (0x300000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS10_SHIFT  (20U)
/*! IDXBLK_STATUS10 - idxblk_status10 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS10(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS10_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS10_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS11_MASK   (0xC00000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS11_SHIFT  (22U)
/*! IDXBLK_STATUS11 - idxblk_status11 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS11(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS11_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS11_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS12_MASK   (0x3000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS12_SHIFT  (24U)
/*! IDXBLK_STATUS12 - idxblk_status12 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS12(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS12_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS12_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS13_MASK   (0xC000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS13_SHIFT  (26U)
/*! IDXBLK_STATUS13 - idxblk_status13 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS13(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS13_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS13_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS14_MASK   (0x30000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS14_SHIFT  (28U)
/*! IDXBLK_STATUS14 - idxblk_status14 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS14(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS14_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS14_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS15_MASK   (0xC0000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS15_SHIFT  (30U)
/*! IDXBLK_STATUS15 - idxblk_status15 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS15(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS15_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS15_MASK)
/*! @} */

/*! @name IDXBLK_SHIFT - PUF Key Manager Shift Status */
/*! @{ */

#define PUF_IDXBLK_SHIFT_IND_KEY0_MASK           (0xFU)
#define PUF_IDXBLK_SHIFT_IND_KEY0_SHIFT          (0U)
/*! IND_KEY0 - Index of key space in block 0 */
#define PUF_IDXBLK_SHIFT_IND_KEY0(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_SHIFT_IND_KEY0_SHIFT)) & PUF_IDXBLK_SHIFT_IND_KEY0_MASK)

#define PUF_IDXBLK_SHIFT_IND_KEY1_MASK           (0xF0U)
#define PUF_IDXBLK_SHIFT_IND_KEY1_SHIFT          (4U)
/*! IND_KEY1 - Index of key space in block 1 */
#define PUF_IDXBLK_SHIFT_IND_KEY1(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_SHIFT_IND_KEY1_SHIFT)) & PUF_IDXBLK_SHIFT_IND_KEY1_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PUF_Register_Masks */


/*!
 * @}
 */ /* end of group PUF_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_PUF_H_ */

